test/testData/dummy_payment_collection.json

{
  "total_count": 52,
  "object": "list",
  "data": [
    {
      "refund_status": "",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_ihino4i8HzbcE0er",
      "payout_type": "Cr",
      "fee": 0,
      "payout_amount": 0,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "authorized",
      "description": "new payment done",
      "order_id": "order_2JWri9Czw65UwirK",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 0,
        "object": "list",
        "data": []
      },
      "refunded_amount": 0,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872193
    },
    {
      "refund_status": "",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_pUqPyhuy4MdZbOUZ",
      "payout_type": "Cr",
      "fee": 0,
      "payout_amount": 0,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "authorized",
      "description": "new payment done",
      "order_id": "order_vxVsQ5cU9as3d6YV",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 0,
        "object": "list",
        "data": []
      },
      "refunded_amount": 0,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872192
    },
    {
      "refund_status": "",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_fSyqIzqJJgTcTxFs",
      "payout_type": "Cr",
      "fee": 0,
      "payout_amount": 0,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "authorized",
      "description": "new payment done",
      "order_id": "order_RD45Lf1GahkcwpVt",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 0,
        "object": "list",
        "data": []
      },
      "refunded_amount": 0,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872191
    },
    {
      "refund_status": "",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_Zwj2v3gGHMUPp7ip",
      "payout_type": "Cr",
      "fee": 0,
      "payout_amount": 0,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "authorized",
      "description": "new payment done",
      "order_id": "order_tHd84cOGjwJ6TM6a",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 0,
        "object": "list",
        "data": []
      },
      "refunded_amount": 0,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872190
    },
    {
      "refund_status": "",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_dUAZF7icox2IX8zN",
      "payout_type": "Cr",
      "fee": 0,
      "payout_amount": 0,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "authorized",
      "description": "new payment done",
      "order_id": "order_FZQzU9klaQrIFpSB",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 0,
        "object": "list",
        "data": []
      },
      "refunded_amount": 0,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872189
    },
    {
      "refund_status": "",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_J90BAL1aLN73D4JK",
      "payout_type": "Cr",
      "fee": 0,
      "payout_amount": 0,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "authorized",
      "description": "new payment done",
      "order_id": "order_fPvkDA8w4NIUNXDm",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 0,
        "object": "list",
        "data": []
      },
      "refunded_amount": 0,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872188
    },
    {
      "refund_status": "partial",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_Qi9ZJTdgJDZhFP8S",
      "payout_type": "Cr",
      "fee": 5,
      "payout_amount": 995,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "captured",
      "description": "new payment done",
      "order_id": "order_0KzVqSU5KNZqVsZ9",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 1,
        "object": "list",
        "data": [
          {
            "payment_id": "pay_Qi9ZJTdgJDZhFP8S",
            "created_at": 1495883327,
            "object": "refund",
            "id": "rfnd_ln04IK0ct0tEVeOt",
            "currency": "INR",
            "amount": 100,
            "notes": {}
          }
        ]
      },
      "refunded_amount": 100,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872187
    },
    {
      "refund_status": "partial",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_436qhlVKtwybrUzm",
      "payout_type": "Cr",
      "fee": 5,
      "payout_amount": 995,
      "bank": "",
      "international": false,
      "method": "emi",
      "status": "captured",
      "description": "new payment done",
      "order_id": "order_NRyLmdvqh8zhB7St",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 1,
        "object": "list",
        "data": [
          {
            "payment_id": "pay_436qhlVKtwybrUzm",
            "created_at": 1495883385,
            "object": "refund",
            "id": "rfnd_f54ozdP5y9Tppfy2",
            "currency": "INR",
            "amount": 1,
            "notes": {}
          }
        ]
      },
      "refunded_amount": 1,
      "notes": {
        "merchant": "id"
      },
      "emi": {
          "tenure": 14,
          "interest_rate": 12,
          "provider": "HDFC Bank",
          "subvention": "merchant"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872185
    },
    {
      "refund_status": "",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_qcQZKyYuucgTUH4M",
      "payout_type": "Cr",
      "fee": 0,
      "payout_amount": 0,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "authorized",
      "description": "new payment done",
      "order_id": "order_cTmOZhUnsc3fcRC6",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 0,
        "object": "list",
        "data": []
      },
      "refunded_amount": 0,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872184
    },
    {
      "refund_status": "",
      "service_tax": 0,
      "currency": "INR",
      "id": "pay_pMxoMEUIb0qZZIvA",
      "payout_type": "Cr",
      "fee": 0,
      "payout_amount": 0,
      "bank": "",
      "international": false,
      "method": "card",
      "status": "authorized",
      "description": "new payment done",
      "order_id": "order_F5b3kRhpp7IvKClA",
      "object": "payment",
      "card": "visa-debit",
      "refunds": {
        "total_count": 0,
        "object": "list",
        "data": []
      },
      "refunded_amount": 0,
      "notes": {
        "merchant": "id"
      },
      "email": "test@ppm.com",
      "wallet": "",
      "amount": 1000,
      "contact": "9999999999",
      "error_description": "",
      "error_code": "",
      "created_at": 1495872183
    }
  ]
}
