test/testData/dummy_payment_collection_filters.json

{
    "total_count": 52,
    "object": "list",
    "data": [
        {
            "refund_status": "",
            "service_tax": 0,
            "currency": "INR",
            "id": "pay_fSyqIzqJJgTcTxFs",
            "payout_type": "Cr",
            "fee": 0,
            "payout_amount": 0,
            "bank": "",
            "international": false,
            "method": "card",
            "status": "authorized",
            "description": "new payment done",
            "order_id": "order_RD45Lf1GahkcwpVt",
            "object": "payment",
            "card": "visa-debit",
            "refunds": {
                "total_count": 0,
                "object": "list",
                "data": []
            },
            "refunded_amount": 0,
            "notes": {
                "merchant": "id"
            },
            "email": "test@ppm.com",
            "wallet": "",
            "amount": 1000,
            "contact": "9999999999",
            "error_description": "",
            "error_code": "",
            "created_at": 1495872191
        },
        {
            "refund_status": "",
            "service_tax": 0,
            "currency": "INR",
            "id": "pay_Zwj2v3gGHMUPp7ip",
            "payout_type": "Cr",
            "fee": 0,
            "payout_amount": 0,
            "bank": "",
            "international": false,
            "method": "card",
            "status": "authorized",
            "description": "new payment done",
            "order_id": "order_tHd84cOGjwJ6TM6a",
            "object": "payment",
            "card": "visa-debit",
            "refunds": {
                "total_count": 0,
                "object": "list",
                "data": []
            },
            "refunded_amount": 0,
            "notes": {
                "merchant": "id"
            },
            "email": "test@ppm.com",
            "wallet": "",
            "amount": 1000,
            "contact": "9999999999",
            "error_description": "",
            "error_code": "",
            "created_at": 1495872190
        },
        {
            "refund_status": "",
            "service_tax": 0,
            "currency": "INR",
            "id": "pay_dUAZF7icox2IX8zN",
            "payout_type": "Cr",
            "fee": 0,
            "payout_amount": 0,
            "bank": "",
            "international": false,
            "method": "card",
            "status": "authorized",
            "description": "new payment done",
            "order_id": "order_FZQzU9klaQrIFpSB",
            "object": "payment",
            "card": "visa-debit",
            "refunds": {
                "total_count": 0,
                "object": "list",
                "data": []
            },
            "refunded_amount": 0,
            "notes": {
                "merchant": "id"
            },
            "email": "test@ppm.com",
            "wallet": "",
            "amount": 1000,
            "contact": "9999999999",
            "error_description": "",
            "error_code": "",
            "created_at": 1495872189
        },
        {
            "refund_status": "",
            "service_tax": 0,
            "currency": "INR",
            "id": "pay_J90BAL1aLN73D4JK",
            "payout_type": "Cr",
            "fee": 0,
            "payout_amount": 0,
            "bank": "",
            "international": false,
            "method": "card",
            "status": "authorized",
            "description": "new payment done",
            "order_id": "order_fPvkDA8w4NIUNXDm",
            "object": "payment",
            "card": "visa-debit",
            "refunds": {
                "total_count": 0,
                "object": "list",
                "data": []
            },
            "refunded_amount": 0,
            "notes": {
                "merchant": "id"
            },
            "email": "test@ppm.com",
            "wallet": "",
            "amount": 1000,
            "contact": "9999999999",
            "error_description": "",
            "error_code": "",
            "created_at": 1495872188
        }
    ]
}
